benchmarks/results/20260705220704-smoke/raw.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/ingest.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 40s max duration (incl. graceful stop):
              * constant_request_rate: 10.00 iterations/s for 10s (maxVUs: 10-100, gracefulStop: 30s)


running (01.0s), 000/010 VUs, 10 complete and 0 interrupted iterations
constant_request_rate   [  10% ] 000/010 VUs  01.0s/10s  10.00 iters/s

running (02.0s), 000/010 VUs, 20 complete and 0 interrupted iterations
constant_request_rate   [  20% ] 000/010 VUs  02.0s/10s  10.00 iters/s

running (03.0s), 000/010 VUs, 30 complete and 0 interrupted iterations
constant_request_rate   [  30% ] 000/010 VUs  03.0s/10s  10.00 iters/s

running (04.0s), 000/010 VUs, 40 complete and 0 interrupted iterations
constant_request_rate   [  40% ] 000/010 VUs  04.0s/10s  10.00 iters/s

running (05.0s), 000/010 VUs, 50 complete and 0 interrupted iterations
constant_request_rate   [  50% ] 000/010 VUs  05.0s/10s  10.00 iters/s

running (06.0s), 000/010 VUs, 60 complete and 0 interrupted iterations
constant_request_rate   [  60% ] 000/010 VUs  06.0s/10s  10.00 iters/s

running (07.0s), 000/010 VUs, 70 complete and 0 interrupted iterations
constant_request_rate   [  70% ] 000/010 VUs  07.0s/10s  10.00 iters/s

running (08.0s), 000/010 VUs, 80 complete and 0 interrupted iterations
constant_request_rate   [  80% ] 000/010 VUs  08.0s/10s  10.00 iters/s

running (09.0s), 000/010 VUs, 90 complete and 0 interrupted iterations
constant_request_rate   [  90% ] 000/010 VUs  09.0s/10s  10.00 iters/s

running (10.0s), 000/010 VUs, 100 complete and 0 interrupted iterations
constant_request_rate   [ 100% ] 000/010 VUs  10.0s/10s  10.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 100     9.999755/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ status was 202

    HTTP
    http_req_duration..............: avg=2.89ms min=1.38ms med=1.94ms max=75.43ms p(90)=2.98ms p(95)=3.54ms
      { expected_response:true }...: avg=2.89ms min=1.38ms med=1.94ms max=75.43ms p(90)=2.98ms p(95)=3.54ms
    http_req_failed................: 0.00% 0 out of 100
    http_reqs......................: 100   9.999755/s

    EXECUTION
    iteration_duration.............: avg=3.13ms min=1.52ms med=2.11ms max=77.26ms p(90)=3.15ms p(95)=3.98ms
    iterations.....................: 100   9.999755/s
    vus............................: 0     min=0        max=0 
    vus_max........................: 10    min=10       max=10

    NETWORK
    data_received..................: 16 kB 1.6 kB/s
    data_sent......................: 35 kB 3.5 kB/s



running (10.0s), 000/010 VUs, 100 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 000/010 VUs  10s  10.00 iters/s